---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LinearConstraintNotParallel
source: html/f94d6c5a-19ec-a163-0a96-bb8abf6836f6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.LinearConstraintNotParallel Property

The References of the highlighted Dimension are no longer parallel.

## Syntax (C#)
```csharp
public static FailureDefinitionId LinearConstraintNotParallel { get; }
```